RT-Thread/rt-thread/bsp/stm32f20x/Libraries/STM32F2xx_StdPeriph_Driver/src/stm32f2xx_i2c.c
          - When to use
             - This function is suitable for most applications as well as for startup
               activity since the events are fully described in the product reference
               manual (RM0033).
             - It is also suitable for users who need to define their own events.

          - Limitations
             - If an error occurs (ie. error flags are set besides to the monitored
               flags), the I2C_CheckEvent() function may return SUCCESS despite
               the communication hold or corrupted real state.
               In this case, it is advised to use error interrupts to monitor
               the error events and handle them in the interrupt IRQ handler.

     @note
         For error management, it is advised to use the following functions:
           - I2C_ITConfig() to configure and enable the error interrupts (I2C_IT_ERR).
           - I2Cx_ER_IRQHandler() which is called when the error interrupt occurs.
             Where x is the peripheral instance (I2C1, I2C2 ...)
           - I2C_GetFlagStatus() or I2C_GetITStatus()  to be called into the
             I2Cx_ER_IRQHandler() function in order to determine which error occurred.
           - I2C_ClearFlag() or I2C_ClearITPendingBit() and/or I2C_SoftwareResetCmd()
             and/or I2C_GenerateStop() in order to clear the error flag and source
             and return to correct  communication status.


     2. Advanced state monitoring (Using the function I2C_GetLastEvent())
     --------------------------------------------------------------------
        Using the function I2C_GetLastEvent() which returns the image of both status
        registers in a single word (uint32_t) (Status Register 2 value is shifted left
        by 16 bits and concatenated to Status Register 1).

          - When to use
             - This function is suitable for the same applications above but it
               allows to overcome the mentioned limitation of I2C_GetFlagStatus()
               function.
             - The returned value could be compared to events already defined in
               the library (stm32f2xx_i2c.h) or to custom values defined by user.
               This function is suitable when multiple flags are monitored at the
               same time.
             - At the opposite of I2C_CheckEvent() function, this function allows
               user to choose when an event is accepted (when all events flags are
               set and no other flags are set or just when the needed flags are set
               like I2C_CheckEvent() function.

          - Limitations
             - User may need to define his own events.
             - Same remark concerning the error management is applicable for this
               function if user decides to check only regular communication flags
               (and ignores error flags).


     3. Flag-based state monitoring (Using the function I2C_GetFlagStatus())
     -----------------------------------------------------------------------

      Using the function I2C_GetFlagStatus() which simply returns the status of
      one single flag (ie. I2C_FLAG_RXNE ...).

          - When to use
             - This function could be used for specific applications or in debug
               phase.
             - It is suitable when only one flag checking is needed (most I2C
               events are monitored through multiple flags).
          - Limitations:
             - When calling this function, the Status register is accessed.
               Some flags are cleared when the status register is accessed.
               So checking the status of one Flag, may clear other ones.
             - Function may need to be called twice or more in order to monitor
               one single event.

   For detailed description of Events, please refer to section I2C_Events in
   stm32f2xx_i2c.h file.

@endverbatim
  * @{
  */

/**
  * @brief  Reads the specified I2C register and returns its value.
  * @param  I2C_Register: specifies the register to read.
  *          This parameter can be one of the following values:
  *            @arg I2C_Register_CR1:  CR1 register.
  *            @arg I2C_Register_CR2:   CR2 register.
  *            @arg I2C_Register_OAR1:  OAR1 register.
  *            @arg I2C_Register_OAR2:  OAR2 register.
  *            @arg I2C_Register_DR:    DR register.
  *            @arg I2C_Register_SR1:   SR1 register.
  *            @arg I2C_Register_SR2:   SR2 register.
  *            @arg I2C_Register_CCR:   CCR register.
  *            @arg I2C_Register_TRISE: TRISE register.
  * @retval The value of the read register.
  */
uint16_t I2C_ReadRegister(I2C_TypeDef* I2Cx, uint8_t I2C_Register)
{
  __IO uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));
  assert_param(IS_I2C_REGISTER(I2C_Register));

  tmp = (uint32_t) I2Cx;
  tmp += I2C_Register;

  /* Return the selected register value */
  return (*(__IO uint16_t *) tmp);
}

/**
  * @brief  Enables or disables the specified I2C interrupts.
  * @param  I2Cx: where x can be 1, 2 or 3 to select the I2C peripheral.
  * @param  I2C_IT: specifies the I2C interrupts sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg I2C_IT_BUF: Buffer interrupt mask
  *            @arg I2C_IT_EVT: Event interrupt mask
  *            @arg I2C_IT_ERR: Error interrupt mask
  * @param  NewState: new state of the specified I2C interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void I2C_ITConfig(I2C_TypeDef* I2Cx, uint16_t I2C_IT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_I2C_ALL_PERIPH(I2Cx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_I2C_CONFIG_IT(I2C_IT));

  if (NewState != DISABLE)
  {
    /* Enable the selected I2C interrupts */
    I2Cx->CR2 |= I2C_IT;
  }
  else
  {
    /* Disable the selected I2C interrupts */
    I2Cx->CR2 &= (uint16_t)~I2C_IT;
  }
}

